app/controllers/testruns_controller.rb

SELECT "testruns".* FROM "testruns"
---
	def index
		@testruns = Testrun.all

INSERT INTO "apps" ("AppNumber", "AppName", "AppVersion", "testrun_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["AppNumber", "1"], ["AppName", "LINE 旅遊大亨"], ["AppVersion", "1.0.1"], ["testrun_id", 84], ["created_at", "2015-03-10 07:27:05.537210"], ["updated_at", "2015-03-10 07:27:05.537210"]]
INSERT INTO "testruns" ("TestRun_Time", "TestRun_Path", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["TestRun_Time", "2020"], ["TestRun_Path", "d"], ["created_at", "2015-03-07 19:54:07.981386"], ["updated_at", "2015-03-07 19:54:07.981386"]]
---
      ap.AppMonkeyResult  =app["AppMonkeyResult"]
      ap.AppMonkeyFailReason  =app["AppMonkeyReason"]
      ap.testrun = tr
      ap.save

SELECT  "testruns".* FROM "testruns" WHERE "testruns"."id" = ? LIMIT 1  [["id", 14]]
DELETE FROM "testruns" WHERE "testruns"."id" = ?  [["id", 14]]
---
	def destroy
		@testrun = Testrun.find(params[:id])

    @testrun.apps.destroy_all