app/controllers/testrun_apps_controller.rb

    def index
      sort_by =(params[:order] == 'AppNumber')? 'AppNumber' : 'created_at'
      @testrun = Testrun.find( params[:testrun_id])
      if params[:AppClass]
        @apps = @testrun.apps.where(:AppClass => params[:AppClass])
        .order(sort_by).page(params[:page]).per(100)
      elsif params[:AppNativeCode]
        @apps = @testrun.apps.where("AppNativeCode LIKE ? "    , "#{params[:AppNativeCode]}%")
        .order(sort_by).page(params[:page]).per(100)
---
SELECT  "testruns".* FROM "testruns" WHERE "testruns"."id" = ? LIMIT 1  [["id", 1]]
SELECT "apps".* FROM "apps" WHERE "apps"."testrun_id" = ?  [["testrun_id", 1]]

    def show
      @testrun = Testrun.find(params[:testrun_id])
    	@app =@testrun.apps.find(params[:id])
---
SELECT  "testruns".* FROM "testruns" WHERE "testruns"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "apps".* FROM "apps" WHERE "apps"."testrun_id" = ? AND "apps"."id" = ? LIMIT 1  [["testrun_id", 1], ["id", 1]]

    def edit
      @testrun = Testrun.find(params[:testrun_id])
      @app = @testrun.apps.find(params[:id])
---
SELECT  "testruns".* FROM "testruns" WHERE "testruns"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "apps".* FROM "apps" WHERE "apps"."testrun_id" = ? AND "apps"."id" = ? LIMIT 1  [["testrun_id", 1], ["id", 1]]